[
    {
        "title": "Addressing Altered Anticipation as a Transdiagnostic Target through Computational Psychiatry",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "Review articleAddressing Altered Anticipation as a Transdiagnostic Target through Computational PsychiatryBiological Psychiatry: Cognitive Neuroscience and NeuroimagingAvailable online 7 March 2025Pradyumna SepúlvedaInes AitsahaliaKiyohito IigayaAbstractExtractsFiguresExport"
    },
    {
        "title": "Coding as another language: Research-based curriculum for early childhood computer science",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "Research articleCoding as another language: Research-based curriculum for early childhood computer scienceEarly Childhood Research Quarterly3rd Quarter 2023Marina Umaschi BersJessica Blake-WestZhanxia YangAbstractExtractsFiguresExport ... thinking. ... However, CAL's impact on computational thinking is less clear given that in the cluster randomized controlled ... trial, both the control and the intervention groups improved equally on a measure of computational thinking ..."
    },
    {
        "title": "Myth of ecological architecture designs: Comparison between design concept and computational analysis results of natural-ventilation for Tjibaou Cultural Center in New Caledonia",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "Research articleMyth of ecological architecture designs: Comparison between design concept and computational analysis results of natural-ventilation for Tjibaou Cultural Center in New CaledoniaEnergy and BuildingsOctober 2011Yu-Chou WuAn-Shik YangChin-Lung LiuAbstractGraphical AbstractFiguresExport"
    },
    {
        "title": "Probabilistic Thinking",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "EncyclopediaProbabilistic ThinkingInternational Encyclopedia of the Social & Behavioral Sciences2001R. M. DawesAbstractFiguresExport"
    },
    {
        "title": "Computational Human Geography",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "EncyclopediaComputational Human GeographyInternational Encyclopedia of Human Geography2009H. CouclelisAbstractExport"
    },
    {
        "title": "Computational models of eye movements and their application to schizophrenia",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "Review articleComputational models of eye movements and their application to schizophreniaCurrent Opinion in Behavioral SciencesOctober 2016Jakob HeinzleEduardo A AponteKlaas Enno StephanAbstractExtractsFiguresExport"
    },
    {
        "title": "Computational Human Geography",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "EncyclopediaComputational Human GeographyInternational Encyclopedia of Human Geography2009H. CouclelisAbstractExport"
    },
    {
        "title": "Artificial intelligence literacy for technology education",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "Research articleOpen accessArtificial intelligence literacy for technology educationComputers and Education OpenJune 2024Karin StolpeJonas HallströmView PDFAbstractExtractsExport ... technological scientific knowledge (e.g., knowledge about what AI is, how to recognise AI, and systems thinking ..."
    },
    {
        "title": "A decomposition-based multi-objective optimization for simultaneous balance computation and transformation in signed networks",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "Research articleA decomposition-based multi-objective optimization for simultaneous balance computation and transformation in signed networksInformation Sciences1 February 2017Lijia MaMaoguo GongHaifeng DuAbstractExtractsFiguresExport"
    },
    {
        "title": "A complete review on biochar: Production, property, multifaceted applications, interaction mechanism and computational approach",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "Research articleA complete review on biochar: Production, property, multifaceted applications, interaction mechanism and computational approachFuel15 May 2021K. JeyasubramanianB. ThangagiriB. RathikaAbstractGraphical AbstractExtractsFiguresExport"
    },
    {
        "title": "The effectiveness of gamification in programming education: Evidence from a meta-analysis",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "Review articleOpen accessThe effectiveness of gamification in programming education: Evidence from a meta-analysisComputers and Education: Artificial Intelligence2022Zehui ZhanLuyao HeXixin LanView PDFAbstractExtractsFiguresExport ... programming types, and schooling levels on students' academic achievement, cognitive load, motivation, and thinking ... gamification application, the games as a competitive mechanism has the greatest impact on students’ thinking ..."
    },
    {
        "title": "The moderating effects of brain network connectivity on the relationship between individual and interactive creativity",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "Research articleThe moderating effects of brain network connectivity on the relationship between individual and interactive creativityThinking Skills and CreativityDecember 2024Ching-Lin WuAbstractFiguresExport"
    },
    {
        "title": "Computational tools for topological coHochschild homology",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "Research articleOpen archiveComputational tools for topological coHochschild homologyTopology and its Applications15 February 2018Anna Marie BohmannTeena GerhardtStephanie ZiegenhagenView PDFAbstractExtractsFiguresExport"
    },
    {
        "title": "A primer on computational simulation in congenital heart disease for the clinician",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "Research articleA primer on computational simulation in congenital heart disease for the clinicianProgress in Pediatric CardiologyDecember 2010Irene E. Vignon-ClementelAlison L. MarsdenJeffrey A. FeinsteinAbstractFiguresExport"
    },
    {
        "title": "Indigenous knowledge, architecture, and nature in the context of Oceania",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "Research articleOpen accessIndigenous knowledge, architecture, and nature in the context of OceaniaNature-Based SolutionsJune 2025Derek KawitiAlbert RefitiMaibritt Pedersen ZariView PDFAbstractExtractsExport ... design for climate change adaptation and offered a novel, distinctive perspective aimed at advancing thinking ..."
    },
    {
        "title": "Computational Neuroscience",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "EncyclopediaComputational NeuroscienceInternational Encyclopedia of the Social & Behavioral Sciences2001T. J. SejnowskiAbstractFiguresExport"
    },
    {
        "title": "Computational models of collective behavior",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "Review articleComputational models of collective behaviorTrends in Cognitive SciencesSeptember 2005Robert L. GoldstoneMarco A. JanssenAbstractFiguresExport"
    },
    {
        "title": "Computational verb systems: a new paradigm for artificial intelligence",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "Research articleComputational verb systems: a new paradigm for artificial intelligenceInformation SciencesMay 2000Tao YangAbstractFiguresExport"
    },
    {
        "title": "Informed speculation with k-level reasoning",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "Research articleInformed speculation with k-level reasoningJournal of Economic TheoryMarch 2022Hang ZhouAbstractExtractsFiguresExport ... This paper investigates the effect of strategic reasoning on financial markets with a level- k thinking ..."
    },
    {
        "title": "One computational approach in support of the Riemann hypothesis",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "Research articleOpen archiveOne computational approach in support of the Riemann hypothesisComputers & Mathematics with ApplicationsJanuary 1999L. AizenbergV. AdamchikV. E. LevitView PDFAbstractExport"
    },
    {
        "title": "Whither computational materials science? Some thoughts from the mechanical properties front",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "Research articleWhither computational materials science? Some thoughts from the mechanical properties frontComputational Materials ScienceJanuary 1994Robb ThomsonAbstractExport"
    },
    {
        "title": "A data parallel finite element method for computational fluid dynamics on the Connection Machine system",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "Research articleOpen archiveA data parallel finite element method for computational fluid dynamics on the Connection Machine systemComputer Methods in Applied Mechanics and EngineeringAugust 1992Zdeněk JohanThomas J. R. HughesS. Lennart JohnssonView PDFAbstractExport"
    },
    {
        "title": "A fast intrusion detection system based on swift wrapper feature selection and speedy ensemble classifier",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "Research articleA fast intrusion detection system based on swift wrapper feature selection and speedy ensemble classifierEngineering Applications of Artificial IntelligenceJuly 2024Ezgi ZorarpaciAbstractExtractsFiguresExport ... IDS, research regarding IDSs having high detection rates and better runtime performance (i.e., lower computational ... hand, the dimensionality reduction techniques help to eliminate unnecessary features and reduce the computation ... In addition, the proposed IDS has a lower computational cost than the state-of-the-art methods. ..."
    },
    {
        "title": "Development and analysis of the Elementary Student Coding Attitudes Survey",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "Research articleDevelopment and analysis of the Elementary Student Coding Attitudes SurveyComputers & EducationAugust 2020Stacie L. MasonPeter J. RichAbstractFiguresExport"
    },
    {
        "title": "The computation intelligent system of role of parental leadership in organizational familiarity in Iraqi Airways employees",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "Research articleThe computation intelligent system of role of parental leadership in organizational familiarity in Iraqi Airways employeesMaterials Today: Proceedings2023Marwan Thakir AbedAbstractFiguresExport"
    },
    {
        "title": "P03-117 A bedside schizophrenia thought disorder scale",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "Conference abstractP03-117 A bedside schizophrenia thought disorder scaleEuropean Psychiatry2009C. P. ArunAbstractExport"
    },
    {
        "title": "Ethical dimensions of algorithmic literacy for college students: Case studies and cross-disciplinary connections",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "Research articleOpen accessEthical dimensions of algorithmic literacy for college students: Case studies and cross-disciplinary connectionsThe Journal of Academic LibrarianshipMay 2024Susan Gardner ArchambaultShalini RamachandranSheree FuView PDFAbstractExtractsFiguresExport ... shared values and testing instructional approaches, this study provides practical tools to shape ethical thinking ..."
    },
    {
        "title": "Reworking the language network",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "Review articleReworking the language networkTrends in Cognitive SciencesMarch 2014Evelina FedorenkoSharon L. Thompson-SchillAbstractFiguresExport"
    },
    {
        "title": "An efficient tree-based computation of a metric comparable to a natural diffusion distance",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "Research articleOpen archiveAn efficient tree-based computation of a metric comparable to a natural diffusion distanceApplied and Computational Harmonic AnalysisSeptember 2012Maxim J. GoldbergSeonja KimView PDFAbstractExport"
    },
    {
        "title": "Artificial Intelligence",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "EncyclopediaArtificial IntelligenceEncyclopedia of Creativity (Third Edition)2020Viktor DörflerAbstractExtractsExport ... INTELLIGENCE is a label coined to describe machines that can perform something humans would perform through thinking ..."
    },
    {
        "title": "What are explanatory proofs in mathematics and how can they contribute to teaching and learning?",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "Research articleWhat are explanatory proofs in mathematics and how can they contribute to teaching and learning?The Journal of Mathematical BehaviorDecember 2024Marc LangeAbstractExtractsFiguresExport ... questions operate in mathematical thinking, teaching, and learning. ..."
    },
    {
        "title": "Geovisualization",
        "author": "Unknown",
        "year": "Unknown",
        "abstract": "EncyclopediaGeovisualizationInternational Encyclopedia of Human Geography2009M. -J. KraakAbstractFiguresExport"
    },
    {
        "title": "Computational Thinking for Digital Culture Development: discussions based on a practical experience",
        "author": "Julia Ortiz, Carolina Moreira, Krissia Menezes, Bernardo Ferrari, Deogenes Junior",
        "year": "2021",
        "abstract": "Computational Thinking has been understood as an essential ability in a society mediated by technology. However, literature in the field shows that initiatives for developing this ability rarely address challenging contexts audiences. In this paper, we ..."
    },
    {
        "title": "Introducing computational thinking to pre-service teachers",
        "author": "Jiang Li, Paulette Shockey, Jennifer Cuddapah, Christy Graybeal, Anthony Williams",
        "year": "2020",
        "abstract": "Computational, logic thinking and problem-solving skills are extremely important for students' success in the future. This poster describes a collaborative project that was conducted to promote K-8 Computer Science Education among in-service and pre-..."
    },
    {
        "title": "Computational thinking for all: an experience report on scaling up teaching computational thinking to all students in a major city in Sweden",
        "author": "Fredrik Heintz, Linda Mannila",
        "year": "2018",
        "abstract": "The Swedish government has recently introduced digital competence including programming in the Swedish K-9 curriculum starting no later than fall 2018. This means that 100 000 teachers need to learn programming and digital competence in less than a year. ..."
    },
    {
        "title": "From computational thinking to computational making",
        "author": "Jennifer A. Rode, Andrea Marshall, Anne Weibert, Konstantin Aal",
        "year": "2015",
        "abstract": "This demo focuses supplements our paper \"From Computational Thinking to Computation Making\" to allow visitors to interact with the various technologies the children in our club created, including an interactive monster. Additionally, to make the demo ..."
    },
    {
        "title": "Grounding Computational Thinking Skill Acquisition Through Contextualized Instruction",
        "author": "Hilarie Nickerson, Catharine Brand, Alexander Repenning",
        "year": "2015",
        "abstract": "Computational thinking (CT) involves a broadly applicable and complex set of processes that are often explained by way of the knowledge, attitudes, and general practices that they entail. However, to become facile with CT, learners require instruction ..."
    },
    {
        "title": "Computational thinking",
        "author": "Jeannette Wing",
        "year": "2009",
        "abstract": "My vision for the 21st Century: Computational thinking will be a fundamental skill used by everyone in the world. Just as reading, writing, and arithmetic are fundamental skills every child learns, computational thinking is a skill needed for every ..."
    },
    {
        "title": "Computational thinking",
        "author": "Peter B. Henderson, Thomas J. Cortina, Jeannette M. Wing",
        "year": "2007",
        "abstract": ""
    },
    {
        "title": "Session details: Computational thinking",
        "author": "Annemieke Craig",
        "year": "2010",
        "abstract": ""
    },
    {
        "title": "Computational thinking",
        "author": "Jeannette M. Wing",
        "year": "2006",
        "abstract": "It represents a universally applicable attitude and skill set everyone, not just computer scientists, would be eager to learn and use."
    },
    {
        "title": "Session details: Computational thinking",
        "author": "Peter Henderson",
        "year": "2007",
        "abstract": ""
    },
    {
        "title": "Session details: Computational thinking",
        "author": "Peter Henderson",
        "year": "2007",
        "abstract": ""
    },
    {
        "title": "Session details: Computational thinking across disciplines",
        "author": "John Rabung",
        "year": "2009",
        "abstract": ""
    },
    {
        "title": "Session details: Panel: computational thinking: on weaving it in",
        "author": "Joan Peckham",
        "year": "2009",
        "abstract": ""
    },
    {
        "title": "From theory bias to theory dialogue: embracing cognitive, situated, and critical framings of computational thinking in K-12 CS education",
        "author": "Yasmin Kafai, Chris Proctor, Debora Lui",
        "year": "2020",
        "abstract": ""
    },
    {
        "title": "Adopting, Integrating, and Evaluating Computational Creativity Exercises and an Experience Report",
        "author": "Leen-Kiat Soh, Markeya S. Peteranetz, Olga Glebova",
        "year": "2020",
        "abstract": "In this workshop, participants will learn how to integrate into their classes computational thinking and creative thinking activities that have been shown via rigorous research to significantly improve student learning and performance. Specifically, ..."
    },
    {
        "title": "Students' understanding of basic computational concepts in an introduction to mobile development course",
        "author": "Karen H. Jin",
        "year": "2018",
        "abstract": "Building basic computational thinking skills is an important goal in courses that introduce computing to students with limited programming background. Among choices of tools and platforms, MIT App Inventor is a popular mobile app development environment ..."
    },
    {
        "title": "Does Studying CS Automatically Foster a Growth Mindset?",
        "author": "Michael Lodi",
        "year": "2019",
        "abstract": "Many arguments are used to advocate for the introduction of Computer Science (CS) / Computational Thinking / \"coding\" in K-12 education. Growth mindset theory (GM) is also becoming very popular among educators and researchers. Some claims stating that ..."
    },
    {
        "title": "Integrating Parallel and Distributed Computing in Early Computing Classes",
        "author": "Sheikh Ghafoor, Charles Weems, Alan Sussman, Ramachandran Vaidyanathan",
        "year": "2023",
        "abstract": "Parallel and distributed computing (PDC) has become pervasive in all aspects of computing, and thus it is essential that students include parallelism and distribution in the computational thinking that they apply to problem solving, from the very ..."
    },
    {
        "title": "A plea for modesty",
        "author": "David Hemmendinger",
        "year": "2010",
        "abstract": "From time to time a movement arises that promises to save the world, or at least to make it vastly better. The extraordinary achievements of digital computing make it a locus of such movements today. Yet we should be wary; when movements fail they ..."
    },
    {
        "title": "Exploring Threshold Concepts for Intermediate Students",
        "author": "Brian M. McSkimming, Adrienne Decker",
        "year": "2022",
        "abstract": "Each year, we graduate a fair number of students with college degrees in computing-related disciplines. Each year, we lose a fair number of students out of the discipline. We spend a good deal of time focusing on what is causing students to leave or ..."
    },
    {
        "title": "The community garden hack: participatory experiments in facilitating primary school teacher's appropriation of technology",
        "author": "Arafeh Karimi, Peter Worthy, Paul McInnes, Marie Bodén, Ben Matthews",
        "year": "2017",
        "abstract": "1As technology increasingly pervades the daily life of teachers and students, finding sustainable ways to successfully integrate innovative technologies in classrooms remains a challenge. This paper reports on our experiences designing and running ..."
    },
    {
        "title": "Computing with CORGIS: Diverse, Real-world Datasets for Introductory Computing",
        "author": "Austin Cory Bart, Ryan Whitcomb, Dennis Kafura, Clifford A. Shaffer, Eli Tilevich",
        "year": "2017",
        "abstract": "To successfully bring introductory computing to non-CS majors, one needs to create a curriculum that will appeal to students from diverse disciplines. Several educational theories emphasize the need for introductory contexts that align with students' ..."
    },
    {
        "title": "Exploring the Effects of Physical Embodiment in a Puzzle-Based Educational Programming Game",
        "author": "Edward F. Melcer",
        "year": "2017",
        "abstract": "One prominent aspect of programming skills/expertise is that it requires the use of many creative processes such as problem-solving, visualization, reflection, motivation and handling failure. While there have been a variety of puzzle-based educational ..."
    },
    {
        "title": "What We Talk About When We Talk About K-12 Computing Education",
        "author": "Carsten Schulte, Sue Sentance, Sören Sparmann, Rukiye Altin",
        "year": "2025",
        "abstract": "K-12 computing education research is a rapidly growing field of research, both driven by and driving the implementation of computing as a school and extra-curricular subject globally. In the context of discipline-based education research, it is a new and ..."
    },
    {
        "title": "Learning from Nature's Cameras: Bio-Inspired Computational Imaging",
        "author": "Emma Alexander",
        "year": "2025",
        "abstract": "For the past half-billion years, evolution has produced a diversity of eyes and brains that work together to solve visual problems with remarkable efficiency and robustness. By reverse-engineering these systems, we can uncover powerful principles to ..."
    },
    {
        "title": "Enhancing conceptual understanding in early years of Computing education",
        "author": "Anaclara Gerosa, Maria Kallia",
        "year": "2025",
        "abstract": "Computer science (CS) education has been progressively introduced in compulsory curriculums worldwide. In younger children (5-8 years old) it is especially relevant to explore developmentally appropriate teaching methods. Despite a wide variety of ..."
    },
    {
        "title": "Making Music with Computers: Creative Programming in Python (Abstract Only)",
        "author": "Bill Manaris, Andrew R. Brown, Tobias Kohn",
        "year": "2015",
        "abstract": "This is an introduction to creative software development and music making in Python. This material is intended for CS0/CS1 courses and for courses at the intersection of computing and the arts. The workshop will introduce music making activities for ..."
    }
]